rottenpotatoes/app/controllers/movies_controller.rb

  def same_director
    id = params[:id]
    movie = Movie.find_by_id id
    if not movie.director or movie.director.empty?
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]
SELECT COUNT(*) FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]